old/short_pretty.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>https://ws.negocio.registroHostelero.a19.gvdi.com/envioFichero</wsa:Action>
        <wsa:MessageID>urn:uuid:e11d9f0a-6447-4ab9-b5eb-d59a2a3f96a4</wsa:MessageID>
        <wsa:To>https://servicios.pre.ertzaintza.eus/A19/registroHostelero/EnvioFichero</wsa:To>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <Reference URI="#idBody">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>07Qhgz2/DPGdxxGq9USfrTSUQM4=</DigestValue>
                    </Reference>
                    <Reference URI="#idTimestampToken">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>R3wFfOtpV4i+ocdValgv09bKgsw=</DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue>l4o1HFQ1uVs+OdgksfGH//DLy4t8w8+fIrUCrfWCEgpY1VI9sAFLwnwlyTwMY2CI
                    QQpKxAS1XILmJsC5PCF9dI1xQeKpBfjgVjACuG17nlIcK0vRaSUIlnRN6uY+vtDS
                    SzQCZM9Vp6Jo78TD9G/knrw04qC8Kx/x/TYTUeX5wHtQqHuGQHchoaO8SW6yUvIO
                    6QQMxuEgqavvNoLtnVcTFyzPpTdzeLBKKN9/pVrQxwDlxsde0wKWX0XIDatvVtWq
                    a0RI0tiUctPwa8o0PA3JbVdRWfa/zqA7H9JV5XuMyKgL/9qM7iSN2wwbvHG67ENF
                    KUEAfx40Jh2t0aYY9aZEvQ==
                </SignatureValue>
                <KeyInfo>
                    <wsse:SecurityTokenReference>
                        <X509Data>
                            <X509IssuerSerial>
                                <X509IssuerName>CN=IGORLE,OU=Seguridad,O=Eusko Jaurlaritza,L=Erandio,ST=Bizkaia,C=ES
                                </X509IssuerName>
                                <X509SerialNumber>1873262687911555804216131403838941426631066787</X509SerialNumber>
                            </X509IssuerSerial>
                            <X509Certificate>MIIIMDCCBhigAwIBAgITVAAARKM3+j7SvqkaTgABAABEozANBgkqhkiG9w0BAQsF
                                ADByMQswCQYDVQQGEwJFUzEQMA4GA1UECBMHQml6a2FpYTEQMA4GA1UEBxMHRXJh
                                bmRpbzEaMBgGA1UEChMRRXVza28gSmF1cmxhcml0emExEjAQBgNVBAsTCVNlZ3Vy
                                aWRhZDEPMA0GA1UEAxMGSUdPUkxFMB4XDTIxMDIxMTE1NTIxMloXDTI3MDIxMDE1
                                NTIxMlowczETMBEGCgmSJomT8ixkARkWA25ldDEYMBYGCgmSJomT8ixkARkWCGVq
                                aHNndmRpMQ8wDQYDVQQLEwZHbG9iYWwxGTAXBgNVBAsTEEFwbGljYWNpb25lcyBQ
                                cmUxFjAUBgNVBAMTDUExOVBSRUVNUFJFU0EwggEiMA0GCSqGSIb3DQEBAQUAA4IB
                                DwAwggEKAoIBAQDLDarTFoCnlLpY8+3EPuCUDA9G8AW7Fc5HB1UoFJLx+0YJm+mN
                                lGhIizal5yyy6b4IRp4FRGhXZsQek6Cu46bruDsWLdahMcDhmAgGsnFhfBm44+6o
                                XM+vCmwwLiJ+TKZCU9AKGleRHBWFewQWDLO+ANLoYIVZz/Cjyn2aIzv1Wa/PPmhw
                                n0M8iHm1UV/J3gQylyqrltBPx1jOLaC/enP3indaq0QvDk3HHaWegnvfS7AHeb3f
                                F1UllGrMr1HaJ8WI9BVtq5Ezxp275A5XyDF8/y8Hm7P2XA7G3MIssd+R0cUEdT4j
                                vfe6iNgIrdoF/lt9xWtfHd1HfYYKeQQRR44xAgMBAAGjggO8MIIDuDA8BgkrBgEE
                                AYI3FQcELzAtBiUrBgEEAYI3FQiE4akQha+8ZpGBNISs2jqGkuhXC4LauiOFgJYw
                                AgFkAgEMMB0GA1UdJQQWMBQGCCsGAQUFBwMDBggrBgEFBQcDAjALBgNVHQ8EBAMC
                                B4AwJwYJKwYBBAGCNxUKBBowGDAKBggrBgEFBQcDAzAKBggrBgEFBQcDAjAdBgNV
                                HQ4EFgQUvq3C6iVGmd5QDyDjolNM7+ZhJS4wHwYDVR0jBBgwFoAU7ROVpuDAJPIn
                                0dQB367gl4XHy/MwggEhBgNVHR8EggEYMIIBFDCCARCgggEMoIIBCIaBr2xkYXA6
                                Ly8vQ049SUdPUkxFLENOPVZJUlAwNDQ2LENOPUNEUCxDTj1QdWJsaWMlMjBLZXkl
                                MjBTZXJ2aWNlcyxDTj1TZXJ2aWNlcyxDTj1Db25maWd1cmF0aW9uLERDPWVqaHNn
                                dmRpLERDPW5ldD9jZXJ0aWZpY2F0ZVJldm9jYXRpb25MaXN0P2Jhc2U/b2JqZWN0
                                Q2xhc3M9Y1JMRGlzdHJpYnV0aW9uUG9pbnSGKGh0dHA6Ly9wa2kuZ3VyZS1uZXQu
                                bmV0L0NlcnRzL0lHT1JMRS5jcmyGKmh0dHA6Ly9wa2kuZXJ0emFpbnR6YS5ldXMv
                                Q2VydHMvSUdPUkxFLmNybDCCAYUGCCsGAQUFBwEBBIIBdzCCAXMwgaYGCCsGAQUF
                                BzAChoGZbGRhcDovLy9DTj1JR09STEUsQ049QUlBLENOPVB1YmxpYyUyMEtleSUy
                                MFNlcnZpY2VzLENOPVNlcnZpY2VzLENOPUNvbmZpZ3VyYXRpb24sREM9ZWpoc2d2
                                ZGksREM9bmV0P2NBQ2VydGlmaWNhdGU/YmFzZT9vYmplY3RDbGFzcz1jZXJ0aWZp
                                Y2F0aW9uQXV0aG9yaXR5MDcGCCsGAQUFBzAChitodHRwOi8vcGtpLmd1cmUtbmV0
                                Lm5ldC9DZXJ0cy9JR09STEUoMSkuY3J0MDkGCCsGAQUFBzAChi1odHRwOi8vcGtp
                                LmVydHphaW50emEuZXVzL0NlcnRzL0lHT1JMRSgxKS5jcnQwKAYIKwYBBQUHMAGG
                                HGh0dHA6Ly9wa2kuZ3VyZS1uZXQubmV0L29jc3AwKgYIKwYBBQUHMAGGHmh0dHA6
                                Ly9wa2kuZXJ0emFpbnR6YS5ldXMvb2NzcDA1BgNVHREELjAsoCoGCisGAQQBgjcU
                                AgOgHAwaQTE5UFJFRU1QUkVTQUBlamhzZ3ZkaS5uZXQwDQYJKoZIhvcNAQELBQAD
                                ggIBAAFay/FvcmFd93FLvQIYslbya3gTXyE9s6t7nwiHoufKwwKeaBf0w4O6Z7wz
                                8HEpCYYaqK1FAUTBlqqwd567EqF64rgb9lZrvq4RR/gTkJjL818ltZlUE+c7Guqt
                                KcrYjnybm4L+hwHc64xR9C9y0DDD0bvUxzy0w8yc9zX7oVw2myPZD09NPdslyEKD
                                GgNDKaUwoyn43SYnLWdaWtwLPbiGFatN0LzoyHvnobhBRQ3jMG9ypx7Dqqw+Ue3A
                                NS6TtgY/4xBzpfOaDWE1hQ+JUqJAhrzvmszF4DB3BvBgpEWOhIrcHSyu7DmbUIPk
                                YneqsLNrfibfWSV/tY8IqkBZPqvnWOJ5ICvPUOk8F99yM90JissWPPTgApdpLEVm
                                3xMJez7UtVFsLLbmh9o0Mjqdu5oiUB3fv2LBp3oVjSw6GnmCEO6lmenqAmGKZUIs
                                Bgc9S0hQiT49hwELq2eVcI8jDiDn4LlhTkShQr2nIwLaAg5pr74iW7aa3lsThHOD
                                Z4TGvpU7smX0s386X4ZPFlJazjJ9bJGTeJpfNZucVUf9Jn0mlH3s+Qq3cfDo201L
                                jC3m1DimQSRGKcepZAL8xpKJHfj5MtHSvkLrVz0SxhUmD8E15My6mG1K68flEuCs
                                kwQULGBPRGapCBvHpDsgAgLtGryyIVMemUMdMpSFyEz1Mrpc
                            </X509Certificate>
                        </X509Data>
                    </wsse:SecurityTokenReference>
                </KeyInfo>
            </Signature>
            <wsse:UsernameToken>
                <wsse:Username>202004</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
                    O6l+fxrRzNG97rk7wb/xW5UhQac=
                </wsse:Password>
                <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    xZEOdTc7uAq0eVzHw/wdwA==
                </wsse:Nonce>
                <wsu:Created
                        xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                    2024-01-06T22:41:53+00:00
                </wsu:Created>
            </wsse:UsernameToken>
            <wsu:Timestamp
                    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                    wsu:Id="idTimestampToken">
                <wsu:Created>2024-01-06T16:41:53Z</wsu:Created>
                <wsu:Expires>2024-01-06T16:51:53Z</wsu:Expires>
                <wsu:Nonce>HcrcpxNE2j6Ejj7ojZVGLQ==</wsu:Nonce>
            </wsu:Timestamp>
            <wsu:Timestamp
                    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                    wsu:Id="idTiTok">
                <wsu:Nonce>8w7pganXk2RkZF1ixj4NNQ==</wsu:Nonce>
            </wsu:Timestamp>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                   ns1:Id="idBody">
        <ns0:envioFichero xmlns:ns0="https://ws.negocio.registroHostelero.a19.gvdi.com">
            <ns0:fichero>
                MXwyMDIwMDR8QkxBSSBCTEFJIEFURVJQRVRYRUEgQlNTMDAwMjl8MjAyMzEyMDJ8MDE0MXwxfAoyfHwyMDQ0MTczMTIwNnxYfDIwMjMwNDAyfENPUk9ORUx8TUFOUklRVUVafEdFTkFSTyBFWkVRVUlFTHxNfDE5ODYwNDAyfEFSR0VOVElOQXwyMDIzMTIwMQ==
            </ns0:fichero>
            <ns0:language>es</ns0:language>
            <ns0:nombreFichero>202004.txt</ns0:nombreFichero>
            <ns0:cif>B20805578</ns0:cif>
        </ns0:envioFichero>
    </soap-env:Body>
    <soap-env:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       soap-env:mustUnderstand="0">
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-2117099736">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#idBody">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue/>
                    </ds:Reference>
                    <ds:Reference URI="#idTimestampToken">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                        </ds:Transforms>
                        <ds:DigestMethod
                                Algorithm="http://w                                               ww.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue/>
                    </ds:Reference>
                    <ds:Reference URI="#idTiTok">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue/>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue/>
                <ds:KeyInfo>
                    <ds:KeyValue/>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </soap-env:Header>
</soap-env:Envelope>
